from gen_synthetic import generate_dataset


if __name__ == "__main__":
    generate_dataset(
        "احساسات و عواطف",
        "شما یک متخصص در تشخیص احساسات هستید. باید متن‌های فارسی را از نظر احساسات (شادی، غم، خشم، نفرت، ترس، تعجب) تحلیل و دسته‌بندی کنید. در متن خروجی، فقط نام دسته‌بندی مروبطه را بدون توضیح و متن اضافی بنویسید.",
        "لطفاً یک متن فارسی کوتاه (حداکثر ۳ جمله) بنویسید که یکی از احساسات اصلی (شادی، غم، خشم، نفرت، ترس، تعجب) را نشان دهد. سپس مشخص کنید که این متن کدام احساس را بیان می‌کند.",
        tree_degree=10,
        tree_depth=4,
        num_steps=100,
        batch_size=100,
    )
